betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_pcd.c
  hpcd->State = DAL_PCD_STATE_BUSY;

#if defined (USB_OTG_FS)
  /* Disable DMA mode for FS instance */
  if (USBx == USB_OTG_FS)
  {
    hpcd->Init.dma_enable = 0U;
  }
#endif /* defined (USB_OTG_FS) */
#if defined (USB_OTG_FS2)
  else if (USBx == USB_OTG_FS2)
  {
    hpcd->Init.dma_enable = 0U;
  }
#endif /* defined (USB_OTG_FS2) */

  /* Disable the Interrupts */
  __DAL_PCD_DISABLE(hpcd);

  /*Init the Core (common init.) */
  if (USB_CoreInit(hpcd->Instance, hpcd->Init) != DAL_OK)
  {
    hpcd->State = DAL_PCD_STATE_ERROR;
    return DAL_ERROR;
  }

  /* Force Device Mode*/
  if (USB_SetCurrentMode(hpcd->Instance, USB_DEVICE_MODE) != DAL_OK)
  {
    hpcd->State = DAL_PCD_STATE_ERROR;
    return DAL_ERROR;
  }

  /* Init endpoints structures */
  for (i = 0U; i < hpcd->Init.dev_endpoints; i++)
  {
    /* Init ep structure */
    hpcd->IN_ep[i].is_in = 1U;
    hpcd->IN_ep[i].num = i;
    hpcd->IN_ep[i].tx_fifo_num = i;
    /* Control until ep is activated */
    hpcd->IN_ep[i].type = EP_TYPE_CTRL;
    hpcd->IN_ep[i].maxpacket = 0U;
    hpcd->IN_ep[i].xfer_buff = 0U;
    hpcd->IN_ep[i].xfer_len = 0U;
  }

  for (i = 0U; i < hpcd->Init.dev_endpoints; i++)
  {
    hpcd->OUT_ep[i].is_in = 0U;
    hpcd->OUT_ep[i].num = i;
    /* Control until ep is activated */
    hpcd->OUT_ep[i].type = EP_TYPE_CTRL;
    hpcd->OUT_ep[i].maxpacket = 0U;
    hpcd->OUT_ep[i].xfer_buff = 0U;
    hpcd->OUT_ep[i].xfer_len = 0U;
  }

  /* Init Device */
  if (USB_DevInit(hpcd->Instance, hpcd->Init) != DAL_OK)
  {
    hpcd->State = DAL_PCD_STATE_ERROR;
    return DAL_ERROR;
  }

  hpcd->USB_Address = 0U;
  hpcd->State = DAL_PCD_STATE_READY;

  (void)USB_DevDisconnect(hpcd->Instance);

  return DAL_OK;
}

/**
  * @brief  DeInitializes the PCD peripheral.
  * @param  hpcd PCD handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_PCD_DeInit(PCD_HandleTypeDef *hpcd)
{
  /* Check the PCD handle allocation */
  if (hpcd == NULL)
  {
    return DAL_ERROR;
  }

  hpcd->State = DAL_PCD_STATE_BUSY;

  /* Stop Device */
  if (USB_StopDevice(hpcd->Instance) != DAL_OK)
  {
    return DAL_ERROR;
  }

#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
  if (hpcd->MspDeInitCallback == NULL)
  {
    hpcd->MspDeInitCallback = DAL_PCD_MspDeInit; /* Legacy weak MspDeInit  */
  }

  /* DeInit the low level hardware */
  hpcd->MspDeInitCallback(hpcd);
#else
  /* DeInit the low level hardware: CLOCK, NVIC.*/
  DAL_PCD_MspDeInit(hpcd);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */

  hpcd->State = DAL_PCD_STATE_RESET;

  return DAL_OK;
}

/**
  * @brief  Initializes the PCD MSP.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_MspInit(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes PCD MSP.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_MspDeInit(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_MspDeInit could be implemented in the user file
   */
}

#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User USB PCD Callback
  *         To be used instead of the weak predefined callback
  * @param  hpcd USB PCD handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_PCD_SOF_CB_ID USB PCD SOF callback ID
  *          @arg @ref DAL_PCD_SETUPSTAGE_CB_ID USB PCD Setup callback ID
  *          @arg @ref DAL_PCD_RESET_CB_ID USB PCD Reset callback ID
  *          @arg @ref DAL_PCD_SUSPEND_CB_ID USB PCD Suspend callback ID
  *          @arg @ref DAL_PCD_RESUME_CB_ID USB PCD Resume callback ID
  *          @arg @ref DAL_PCD_CONNECT_CB_ID USB PCD Connect callback ID
  *          @arg @ref DAL_PCD_DISCONNECT_CB_ID OTG PCD Disconnect callback ID
  *          @arg @ref DAL_PCD_MSPINIT_CB_ID MspDeInit callback ID
  *          @arg @ref DAL_PCD_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_PCD_RegisterCallback(PCD_HandleTypeDef *hpcd,
                                           DAL_PCD_CallbackIDTypeDef CallbackID,
                                           pPCD_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hpcd->ErrorCode |= DAL_PCD_ERROR_INVALID_CALLBACK;
    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(hpcd);

  if (hpcd->State == DAL_PCD_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_PCD_SOF_CB_ID :
        hpcd->SOFCallback = pCallback;
        break;

      case DAL_PCD_SETUPSTAGE_CB_ID :
        hpcd->SetupStageCallback = pCallback;
        break;

      case DAL_PCD_RESET_CB_ID :
        hpcd->ResetCallback = pCallback;
        break;

      case DAL_PCD_SUSPEND_CB_ID :
        hpcd->SuspendCallback = pCallback;
        break;

      case DAL_PCD_RESUME_CB_ID :
        hpcd->ResumeCallback = pCallback;
        break;

      case DAL_PCD_CONNECT_CB_ID :
        hpcd->ConnectCallback = pCallback;
        break;

      case DAL_PCD_DISCONNECT_CB_ID :
        hpcd->DisconnectCallback = pCallback;
        break;

      case DAL_PCD_MSPINIT_CB_ID :
        hpcd->MspInitCallback = pCallback;
        break;

      case DAL_PCD_MSPDEINIT_CB_ID :
        hpcd->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hpcd->ErrorCode |= DAL_PCD_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (hpcd->State == DAL_PCD_STATE_RESET)
  {
    switch (CallbackID)
    {
      case DAL_PCD_MSPINIT_CB_ID :
        hpcd->MspInitCallback = pCallback;
        break;

      case DAL_PCD_MSPDEINIT_CB_ID :
        hpcd->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hpcd->ErrorCode |= DAL_PCD_ERROR_INVALID_CALLBACK;
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hpcd->ErrorCode |= DAL_PCD_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hpcd);
  return status;
}

/**
  * @brief  Unregister an USB PCD Callback
  *         USB PCD callback is redirected to the weak predefined callback
  * @param  hpcd USB PCD handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_PCD_SOF_CB_ID USB PCD SOF callback ID
  *          @arg @ref DAL_PCD_SETUPSTAGE_CB_ID USB PCD Setup callback ID
  *          @arg @ref DAL_PCD_RESET_CB_ID USB PCD Reset callback ID
  *          @arg @ref DAL_PCD_SUSPEND_CB_ID USB PCD Suspend callback ID
  *          @arg @ref DAL_PCD_RESUME_CB_ID USB PCD Resume callback ID
  *          @arg @ref DAL_PCD_CONNECT_CB_ID USB PCD Connect callback ID
  *          @arg @ref DAL_PCD_DISCONNECT_CB_ID OTG PCD Disconnect callback ID
  *          @arg @ref DAL_PCD_MSPINIT_CB_ID MspDeInit callback ID
  *          @arg @ref DAL_PCD_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_PCD_UnRegisterCallback(PCD_HandleTypeDef *hpcd, DAL_PCD_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hpcd);

  /* Setup Legacy weak Callbacks  */
  if (hpcd->State == DAL_PCD_STATE_READY)
  {
    switch (CallbackID)
    {
      case DAL_PCD_SOF_CB_ID :
        hpcd->SOFCallback = DAL_PCD_SOFCallback;
        break;

      case DAL_PCD_SETUPSTAGE_CB_ID :
        hpcd->SetupStageCallback = DAL_PCD_SetupStageCallback;
        break;

      case DAL_PCD_RESET_CB_ID :
        hpcd->ResetCallback = DAL_PCD_ResetCallback;
        break;

      case DAL_PCD_SUSPEND_CB_ID :
        hpcd->SuspendCallback = DAL_PCD_SuspendCallback;
        break;

