betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_pcd.c
  __DAL_PCD_ENABLE(hpcd);
  (void)USB_DevConnect(hpcd->Instance);
  __DAL_UNLOCK(hpcd);

  return DAL_OK;
}

/**
  * @brief  Stop the USB device.
  * @param  hpcd PCD handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_PCD_Stop(PCD_HandleTypeDef *hpcd)
{
  USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;

  __DAL_LOCK(hpcd);
  __DAL_PCD_DISABLE(hpcd);
  (void)USB_DevDisconnect(hpcd->Instance);

  (void)USB_FlushTxFifo(hpcd->Instance, 0x10U);

  if ((hpcd->Init.battery_charging_enable == 1U) &&
      (hpcd->Init.phy_itface != USB_OTG_ULPI_PHY))
  {
    /* Disable USB Transceiver */
    USBx->GGCCFG &= ~(USB_OTG_GGCCFG_PWEN);
  }

  __DAL_UNLOCK(hpcd);

  return DAL_OK;
}

#if defined (USB_OTG_FS) || defined (USB_OTG_HS)
/**
  * @brief  Handles PCD interrupt request.
  * @param  hpcd PCD handle
  * @retval DAL status
  */
void DAL_PCD_IRQHandler(PCD_HandleTypeDef *hpcd)
{
  USB_OTG_GlobalTypeDef *USBx = hpcd->Instance;
  uint32_t USBx_BASE = (uint32_t)USBx;
  USB_OTG_EPTypeDef *ep;
  uint32_t i;
  uint32_t ep_intr;
  uint32_t epint;
  uint32_t epnum;
  uint32_t fifoemptymsk;
  uint32_t RegVal;

  /* ensure that we are in device mode */
  if (USB_GetMode(hpcd->Instance) == USB_OTG_MODE_DEVICE)
  {
    /* avoid spurious interrupt */
    if (__DAL_PCD_IS_INVALID_INTERRUPT(hpcd))
    {
      return;
    }

    /* store current frame number */
    hpcd->FrameNumber = (USBx_DEVICE->DSTS & USB_OTG_DSTS_SOFNUM_Msk) >> USB_OTG_DSTS_SOFNUM_Pos;

    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_MMIS))
    {
      /* incorrect mode, acknowledge the interrupt */
      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_MMIS);
    }

    /* Handle RxQLevel Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_RXFNONE))
    {
      USB_MASK_INTERRUPT(hpcd->Instance, USB_OTG_GCINT_RXFNONE);

      RegVal = USBx->GRXSTSP;

      ep = &hpcd->OUT_ep[RegVal & USB_OTG_GRXSTSP_EPNUM];

      if (((RegVal & USB_OTG_GRXSTSP_PSTS) >> 17) ==  STS_DATA_UPDT)
      {
        if ((RegVal & USB_OTG_GRXSTSP_BCNT) != 0U)
        {
          (void)USB_ReadPacket(USBx, ep->xfer_buff,
                               (uint16_t)((RegVal & USB_OTG_GRXSTSP_BCNT) >> 4));

          ep->xfer_buff += (RegVal & USB_OTG_GRXSTSP_BCNT) >> 4;
          ep->xfer_count += (RegVal & USB_OTG_GRXSTSP_BCNT) >> 4;
        }
      }
      else if (((RegVal & USB_OTG_GRXSTSP_PSTS) >> 17) == STS_SETUP_UPDT)
      {
        (void)USB_ReadPacket(USBx, (uint8_t *)hpcd->Setup, 8U);
        ep->xfer_count += (RegVal & USB_OTG_GRXSTSP_BCNT) >> 4;
      }
      else
      {
        /* ... */
      }

      USB_UNMASK_INTERRUPT(hpcd->Instance, USB_OTG_GCINT_RXFNONE);
    }

    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_ONEP))
    {
      epnum = 0U;

      /* Read in the device interrupt bits */
      ep_intr = USB_ReadDevAllOutEpInterrupt(hpcd->Instance);

      while (ep_intr != 0U)
      {
        if ((ep_intr & 0x1U) != 0U)
        {
          epint = USB_ReadDevOutEPInterrupt(hpcd->Instance, (uint8_t)epnum);

          if ((epint & USB_OTG_DOEPINT_TSFCMP) == USB_OTG_DOEPINT_TSFCMP)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_TSFCMP);
            (void)PCD_EP_OutXfrComplete_int(hpcd, epnum);
          }

          if ((epint & USB_OTG_DOEPINT_SETPCMP) == USB_OTG_DOEPINT_SETPCMP)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_SETPCMP);
            /* Class B setup phase done for previous decoded setup */
            (void)PCD_EP_OutSetupPacket_int(hpcd, epnum);
          }

          if ((epint & USB_OTG_DOEPINT_RXOTDIS) == USB_OTG_DOEPINT_RXOTDIS)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_RXOTDIS);
          }

          /* Clear OUT Endpoint disable interrupt */
          if ((epint & USB_OTG_DOEPINT_EPDIS) == USB_OTG_DOEPINT_EPDIS)
          {
            if ((USBx->GCINT & USB_OTG_GCINT_GONAKE) == USB_OTG_GCINT_GONAKE)
            {
              USBx_DEVICE->DCTRL |= USB_OTG_DCTRL_GONAKCLR;
            }

            ep = &hpcd->OUT_ep[epnum];

            if (ep->is_iso_incomplete == 1U)
            {
              ep->is_iso_incomplete = 0U;

#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
              hpcd->ISOOUTIncompleteCallback(hpcd, (uint8_t)epnum);
#else
              DAL_PCD_ISOOUTIncompleteCallback(hpcd, (uint8_t)epnum);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */
            }

            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_EPDIS);
          }

          /* Clear Status Phase Received interrupt */
          if ((epint & USB_OTG_DOEPINT_OTEPSPR) == USB_OTG_DOEPINT_OTEPSPR)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_OTEPSPR);
          }

          /* Clear OUT NAK interrupt */
          if ((epint & USB_OTG_DOEPINT_NAK) == USB_OTG_DOEPINT_NAK)
          {
            CLEAR_OUT_EP_INTR(epnum, USB_OTG_DOEPINT_NAK);
          }
        }
        epnum++;
        ep_intr >>= 1U;
      }
    }

    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_INEP))
    {
      /* Read in the device interrupt bits */
      ep_intr = USB_ReadDevAllInEpInterrupt(hpcd->Instance);

      epnum = 0U;

      while (ep_intr != 0U)
      {
        if ((ep_intr & 0x1U) != 0U) /* In ITR */
        {
          epint = USB_ReadDevInEPInterrupt(hpcd->Instance, (uint8_t)epnum);

          if ((epint & USB_OTG_DIEPINT_TSFCMP) == USB_OTG_DIEPINT_TSFCMP)
          {
            fifoemptymsk = (uint32_t)(0x1UL << (epnum & EP_ADDR_MSK));
            USBx_DEVICE->DIEIMASK &= ~fifoemptymsk;

            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_TSFCMP);

            if (hpcd->Init.dma_enable == 1U)
            {
              hpcd->IN_ep[epnum].xfer_buff += hpcd->IN_ep[epnum].maxpacket;

              /* this is ZLP, so prepare EP0 for next setup */
              if ((epnum == 0U) && (hpcd->IN_ep[epnum].xfer_len == 0U))
              {
                /* prepare to rx more setup packets */
                (void)USB_EP0_OutStart(hpcd->Instance, 1U, (uint8_t *)hpcd->Setup);
              }
            }

#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
            hpcd->DataInStageCallback(hpcd, (uint8_t)epnum);
#else
            DAL_PCD_DataInStageCallback(hpcd, (uint8_t)epnum);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */
          }
          if ((epint & USB_OTG_DIEPINT_TO) == USB_OTG_DIEPINT_TO)
          {
            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_TO);
          }
          if ((epint & USB_OTG_DIEPINT_ITXEMP) == USB_OTG_DIEPINT_ITXEMP)
          {
            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_ITXEMP);
          }
          if ((epint & USB_OTG_DIEPINT_IEPNAKE) == USB_OTG_DIEPINT_IEPNAKE)
          {
            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_IEPNAKE);
          }
          if ((epint & USB_OTG_DIEPINT_EPDIS) == USB_OTG_DIEPINT_EPDIS)
          {
            (void)USB_FlushTxFifo(USBx, epnum);

            ep = &hpcd->IN_ep[epnum];

            if (ep->is_iso_incomplete == 1U)
            {
              ep->is_iso_incomplete = 0U;

#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
              hpcd->ISOINIncompleteCallback(hpcd, (uint8_t)epnum);
#else
              DAL_PCD_ISOINIncompleteCallback(hpcd, (uint8_t)epnum);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */
            }

            CLEAR_IN_EP_INTR(epnum, USB_OTG_DIEPINT_EPDIS);
          }
          if ((epint & USB_OTG_DIEPINT_TXFE) == USB_OTG_DIEPINT_TXFE)
          {
            (void)PCD_WriteEmptyTxFifo(hpcd, epnum);
          }
        }
        epnum++;
        ep_intr >>= 1U;
      }
    }

    /* Handle Resume Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_RWAKE))
    {
      /* Clear the Remote Wake-up Signaling */
      USBx_DEVICE->DCTRL &= ~USB_OTG_DCTRL_RWKUPS;

      if (hpcd->LPM_State == LPM_L1)
      {
        hpcd->LPM_State = LPM_L0;

#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
        hpcd->LPMCallback(hpcd, PCD_LPM_L0_ACTIVE);
#else
        DAL_PCDEx_LPM_Callback(hpcd, PCD_LPM_L0_ACTIVE);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */
      }
      else
      {
#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
        hpcd->ResumeCallback(hpcd);
#else
        DAL_PCD_ResumeCallback(hpcd);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */
      }

      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_RWAKE);
    }

