betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_pcd.c
    /* Handle Suspend Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_USBSUS))
    {
      if ((USBx_DEVICE->DSTS & USB_OTG_DSTS_SUSSTS) == USB_OTG_DSTS_SUSSTS)
      {
#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
        hpcd->SuspendCallback(hpcd);
#else
        DAL_PCD_SuspendCallback(hpcd);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */
      }
      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_USBSUS);
    }

    /* Handle Reset Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_USBRST))
    {
      USBx_DEVICE->DCTRL &= ~USB_OTG_DCTRL_RWKUPS;
      (void)USB_FlushTxFifo(hpcd->Instance, 0x10U);

      for (i = 0U; i < hpcd->Init.dev_endpoints; i++)
      {
        USBx_INEP(i)->DIEPINT = 0xFB7FU;
        USBx_INEP(i)->DIEPCTRL &= ~USB_OTG_DIEPCTRL_STALLH;
        USBx_OUTEP(i)->DOEPINT = 0xFB7FU;
        USBx_OUTEP(i)->DOEPCTRL &= ~USB_OTG_DOEPCTRL_STALLH;
        USBx_OUTEP(i)->DOEPCTRL |= USB_OTG_DOEPCTRL_NAKSET;
      }
      USBx_DEVICE->DAEPIMASK |= 0x10001U;

      if (hpcd->Init.use_dedicated_ep1 != 0U)
      {
        USBx_DEVICE->DOUT1MASK |= USB_OTG_DOUTIMASK_SETPCMPM |
                                   USB_OTG_DOUTIMASK_TSFCMPM |
                                   USB_OTG_DOUTIMASK_EPDISM;

        USBx_DEVICE->DEPIMASK |= USB_OTG_DINIMASK_TOM |
                                  USB_OTG_DINIMASK_TSFCMPM |
                                  USB_OTG_DINIMASK_EPDISM;
      }
      else
      {
        USBx_DEVICE->DOUTIMASK |= USB_OTG_DOUTIMASK_SETPCMPM |
                                USB_OTG_DOUTIMASK_TSFCMPM |
                                USB_OTG_DOUTIMASK_EPDISM |
                                USB_OTG_DOUTIMASK_OTEPSPRM |
                                USB_OTG_DOUTIMASK_NAKM;

        USBx_DEVICE->DINIMASK |= USB_OTG_DINIMASK_TOM |
                                USB_OTG_DINIMASK_TSFCMPM |
                                USB_OTG_DINIMASK_EPDISM;
      }

      /* Set Default Address to 0 */
      USBx_DEVICE->DCFG &= ~USB_OTG_DCFG_DADDR;

      /* setup EP0 to receive SETUP packets */
      (void)USB_EP0_OutStart(hpcd->Instance, (uint8_t)hpcd->Init.dma_enable,
                             (uint8_t *)hpcd->Setup);

      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_USBRST);
    }

    /* Handle Enumeration done Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_ENUMD))
    {
      (void)USB_ActivateSetup(hpcd->Instance);
      hpcd->Init.speed = USB_GetDevSpeed(hpcd->Instance);

      /* Set USB Turnaround time */
      (void)USB_SetTurnaroundTime(hpcd->Instance,
                                  DAL_RCM_GetHCLKFreq(),
                                  (uint8_t)hpcd->Init.speed);

#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->ResetCallback(hpcd);
#else
      DAL_PCD_ResetCallback(hpcd);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */

      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_ENUMD);
    }

    /* Handle SOF Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_SOF))
    {
#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->SOFCallback(hpcd);
#else
      DAL_PCD_SOFCallback(hpcd);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */

      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_SOF);
    }

    /* Handle Global OUT NAK effective Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_GONAKE))
    {
      USBx->GINTMASK &= ~USB_OTG_GINTMASK_GONAKEM;

      for (epnum = 1U; epnum < hpcd->Init.dev_endpoints; epnum++)
      {
        if (hpcd->OUT_ep[epnum].is_iso_incomplete == 1U)
        {
          /* Abort current transaction and disable the EP */
          (void)DAL_PCD_EP_Abort(hpcd, (uint8_t)epnum);
        }
      }
    }

    /* Handle Incomplete ISO IN Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_IIINTX))
    {
      for (epnum = 1U; epnum < hpcd->Init.dev_endpoints; epnum++)
      {
        RegVal = USBx_INEP(epnum)->DIEPCTRL;

        if ((hpcd->IN_ep[epnum].type == EP_TYPE_ISOC) &&
            ((RegVal & USB_OTG_DIEPCTRL_EPEN) == USB_OTG_DIEPCTRL_EPEN))
        {
          hpcd->IN_ep[epnum].is_iso_incomplete = 1U;

          /* Abort current transaction and disable the EP */
          (void)DAL_PCD_EP_Abort(hpcd, (uint8_t)(epnum | 0x80U));
        }
      }

      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_IIINTX);
    }

    /* Handle Incomplete ISO OUT Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_IP_OUTTX))
    {
      for (epnum = 1U; epnum < hpcd->Init.dev_endpoints; epnum++)
      {
        RegVal = USBx_OUTEP(epnum)->DOEPCTRL;

        if ((hpcd->OUT_ep[epnum].type == EP_TYPE_ISOC) &&
            ((RegVal & USB_OTG_DOEPCTRL_EPEN) == USB_OTG_DOEPCTRL_EPEN) &&
            ((RegVal & (0x1U << 16)) == (hpcd->FrameNumber & 0x1U)))
        {
          hpcd->OUT_ep[epnum].is_iso_incomplete = 1U;

          USBx->GINTMASK |= USB_OTG_GINTMASK_GONAKEM;

          if ((USBx->GCINT & USB_OTG_GCINT_GONAKE) == 0U)
          {
            USBx_DEVICE->DCTRL |= USB_OTG_DCTRL_GONAKSET;
            break;
          }
        }
      }

      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_IP_OUTTX);
    }

    /* Handle Connection event Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_SREQ))
    {
#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
      hpcd->ConnectCallback(hpcd);
#else
      DAL_PCD_ConnectCallback(hpcd);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */

      __DAL_PCD_CLEAR_FLAG(hpcd, USB_OTG_GCINT_SREQ);
    }

    /* Handle Disconnection event Interrupt */
    if (__DAL_PCD_GET_FLAG(hpcd, USB_OTG_GCINT_OTG))
    {
      RegVal = hpcd->Instance->GINT;

      if ((RegVal & USB_OTG_GINT_SEFLG) == USB_OTG_GINT_SEFLG)
      {
#if (USE_DAL_PCD_REGISTER_CALLBACKS == 1U)
        hpcd->DisconnectCallback(hpcd);
#else
        DAL_PCD_DisconnectCallback(hpcd);
#endif /* USE_DAL_PCD_REGISTER_CALLBACKS */
      }
      hpcd->Instance->GINT |= RegVal;
    }
  }
}


/**
  * @brief  Handles PCD Wakeup interrupt request.
  * @param  hpcd PCD handle
  * @retval DAL status
  */
void DAL_PCD_WKUP_IRQHandler(PCD_HandleTypeDef *hpcd)
{
#if defined (USB_OTG_FS)
  USB_OTG_GlobalTypeDef *USBx;

  USBx = hpcd->Instance;

  if (USBx == USB_OTG_FS)
  {
    /* Clear EINT pending Bit */
    __DAL_USB_OTG_FS_WAKEUP_EINT_CLEAR_FLAG();
  }
#endif /* USB_OTG_FS */
#if defined (USB_OTG_FS2)
  else if (USBx == USB_OTG_FS2)
  {
    /* Clear EINT pending Bit */
    __DAL_USB_OTG_FS2_WAKEUP_EINT_CLEAR_FLAG();
  }
#endif /* USB_OTG_FS2 */
#if defined (USB_OTG_HS)
  else if (USBx == USB_OTG_HS)
  {
    /* Clear EINT pending Bit */
    __DAL_USB_OTG_HS_WAKEUP_EINT_CLEAR_FLAG();
  }
#endif /* USB_OTG_HS */
}
#endif /* defined (USB_OTG_FS) || defined (USB_OTG_HS) */


/**
  * @brief  Data OUT stage callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void DAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_DataOutStageCallback could be implemented in the user file
   */
}

/**
  * @brief  Data IN stage callback
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void DAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_DataInStageCallback could be implemented in the user file
   */
}
/**
  * @brief  Setup stage callback
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_SetupStageCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Start Of Frame callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_SOFCallback could be implemented in the user file
   */
}

/**
  * @brief  USB Reset callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_ResetCallback could be implemented in the user file
   */
}

/**
  * @brief  Suspend event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_SuspendCallback could be implemented in the user file
   */
}

/**
  * @brief  Resume event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_ResumeCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO OUT callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void DAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_ISOOUTIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Incomplete ISO IN callback.
  * @param  hpcd PCD handle
  * @param  epnum endpoint number
  * @retval None
  */
__weak void DAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);
  UNUSED(epnum);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_ISOINIncompleteCallback could be implemented in the user file
   */
}

/**
  * @brief  Connection event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_ConnectCallback could be implemented in the user file
   */
}

/**
  * @brief  Disconnection event callback.
  * @param  hpcd PCD handle
  * @retval None
  */
__weak void DAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hpcd);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_PCD_DisconnectCallback could be implemented in the user file
   */
}

/**
  * @}
  */

